vke/nrf52840_dimmer_rgbw_zigbee/main.c
// устанавливает яркость для конкретного кананала, прописывает аттрибуты и прописывает ШИМ
static void level_control_set_value(bulb_device_ctx_t *p_dimmable_light_ctx, zb_uint16_t new_level)
{
    NRF_LOG_INFO("Set level value: %i for endpoint %hu", new_level, p_dimmable_light_ctx->ep_id);

    ZB_ZCL_SET_ATTRIBUTE(p_dimmable_light_ctx->ep_id, ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL, ZB_ZCL_CLUSTER_SERVER_ROLE, ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID, (zb_uint8_t *)&new_level, ZB_FALSE);

    if (new_level == 0)
    {
        zb_uint8_t value = ZB_FALSE;
        ZB_ZCL_SET_ATTRIBUTE(p_dimmable_light_ctx->ep_id, ZB_ZCL_CLUSTER_ID_ON_OFF, ZB_ZCL_CLUSTER_SERVER_ROLE, ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID, &value, ZB_FALSE);
    }
    else
    {
        zb_uint8_t value = ZB_TRUE;
        ZB_ZCL_SET_ATTRIBUTE(p_dimmable_light_ctx->ep_id, ZB_ZCL_CLUSTER_ID_ON_OFF, ZB_ZCL_CLUSTER_SERVER_ROLE, ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID, &value, ZB_FALSE);
    }

    pwm_set_brightness(p_dimmable_light_ctx, p_dimmable_light_ctx->level_control_attr.current_level);
}

// включает/выключает канал (сохраняя старое значение при включении)
static void on_off_set_value(bulb_device_ctx_t *p_dimmable_light_ctx, zb_bool_t on)
{
    NRF_LOG_INFO("Set ON/OFF value: %i on endpoint: %hu", on, p_dimmable_light_ctx->ep_id);

    ZB_ZCL_SET_ATTRIBUTE(p_dimmable_light_ctx->ep_id, ZB_ZCL_CLUSTER_ID_ON_OFF, ZB_ZCL_CLUSTER_SERVER_ROLE, ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID, (zb_uint8_t *)&on, ZB_FALSE);

    if (on)
    {
        level_control_set_value(p_dimmable_light_ctx, p_dimmable_light_ctx->level_control_attr.current_level);
    }
    else
    {
        pwm_set_brightness(p_dimmable_light_ctx, 0);
    }
}

// обработчик нажатия клавиш на плате
static void buttons_handler(bsp_event_t evt)
{
    zb_ret_t zb_err_code;

    switch (evt)
    {
    case IDENTIFY_MODE_BSP_EVT:
        if (m_dev_ctx_w.identify_attr.identify_time == ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE)
        {
            NRF_LOG_INFO("Bulb put in identifying mode");
            zb_err_code = zb_bdb_finding_binding_target(HA_DIMMABLE_LIGHT_ENDPOINT_W);
            ZB_ERROR_CHECK(zb_err_code);
        }
        else
        {
            NRF_LOG_INFO("Cancel F&B target procedure");
            zb_bdb_finding_binding_target_cancel();
        }
        break;

    default:
        NRF_LOG_INFO("Unhandled BSP Event received: %d", evt);
        break;
    }
}

// настройка портов и железа на плате
static void board_init(void)
{
    ret_code_t err_code;

    // настройка светиков и кнопок платы
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, buttons_handler);
    APP_ERROR_CHECK(err_code);

    // настройка ШИМ
    nrf_drv_pwm_config_t const led_pwm_config =
        {
            .output_pins =
                {
                    DIMMER_CHANNEL_PIN_R | DIMMER_PWM_INVERSION, // channel 0
                    DIMMER_CHANNEL_PIN_G | DIMMER_PWM_INVERSION, // channel 1
                    DIMMER_CHANNEL_PIN_B | DIMMER_PWM_INVERSION, // channel 2
                    DIMMER_CHANNEL_PIN_W | DIMMER_PWM_INVERSION, // channel 3
                },
            .irq_priority = APP_IRQ_PRIORITY_LOWEST,
            .base_clock = NRF_PWM_CLK_1MHz,
            .count_mode = NRF_PWM_MODE_UP,
            .top_value = DIMMER_PWM_VALUE_MAX,
            .load_mode = NRF_PWM_LOAD_INDIVIDUAL,
            .step_mode = NRF_PWM_STEP_AUTO
        };

    err_code = nrf_drv_pwm_init(&m_led_pwm, &led_pwm_config, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_pwm_simple_playback(&m_led_pwm, &m_led_seq, 1, NRF_DRV_PWM_FLAG_LOOP);
    APP_ERROR_CHECK(err_code);
}

// заполнение настроек кластеров эндпоинта
static void dimmable_clusters_attr_init(bulb_device_ctx_t *p_dimmable_light_ctx)
{
    p_dimmable_light_ctx->basic_attr.zcl_version = ZB_ZCL_VERSION;
    p_dimmable_light_ctx->basic_attr.app_version = BULB_INIT_BASIC_APP_VERSION;
    p_dimmable_light_ctx->basic_attr.stack_version = BULB_INIT_BASIC_STACK_VERSION;
    p_dimmable_light_ctx->basic_attr.hw_version = BULB_INIT_BASIC_HW_VERSION;

    ZB_ZCL_SET_STRING_VAL(p_dimmable_light_ctx->basic_attr.mf_name, BULB_INIT_BASIC_MANUF_NAME, ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_MANUF_NAME));
    ZB_ZCL_SET_STRING_VAL(p_dimmable_light_ctx->basic_attr.model_id, BULB_INIT_BASIC_MODEL_ID, ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_MODEL_ID));
    ZB_ZCL_SET_STRING_VAL(p_dimmable_light_ctx->basic_attr.date_code, BULB_INIT_BASIC_DATE_CODE, ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_DATE_CODE));

    p_dimmable_light_ctx->basic_attr.power_source = BULB_INIT_BASIC_POWER_SOURCE;

    ZB_ZCL_SET_STRING_VAL(p_dimmable_light_ctx->basic_attr.location_id, BULB_INIT_BASIC_LOCATION_DESC, ZB_ZCL_STRING_CONST_SIZE(BULB_INIT_BASIC_LOCATION_DESC));

    p_dimmable_light_ctx->basic_attr.ph_env = BULB_INIT_BASIC_PH_ENV;

    p_dimmable_light_ctx->identify_attr.identify_time = ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;

    // белый цвет по дефолту включен, остальные выключены
    if (p_dimmable_light_ctx->ep_id == HA_DIMMABLE_LIGHT_ENDPOINT_W)
      p_dimmable_light_ctx->on_off_attr.on_off = (zb_bool_t)ZB_ZCL_ON_OFF_IS_ON;
    else
      p_dimmable_light_ctx->on_off_attr.on_off = (zb_bool_t)ZB_ZCL_ON_OFF_IS_OFF;

    p_dimmable_light_ctx->on_off_attr.global_scene_ctrl = ZB_TRUE;
    p_dimmable_light_ctx->on_off_attr.on_time = 0;
    p_dimmable_light_ctx->on_off_attr.off_wait_time = 0;

    // белый цвет по дефолту включен, остальные выключены
    if (p_dimmable_light_ctx->ep_id == HA_DIMMABLE_LIGHT_ENDPOINT_W)
      p_dimmable_light_ctx->level_control_attr.current_level = ZB_ZCL_LEVEL_CONTROL_LEVEL_MAX_VALUE;
    else
      p_dimmable_light_ctx->level_control_attr.current_level = ZB_ZCL_LEVEL_CONTROL_LEVEL_MIN_VALUE;

    p_dimmable_light_ctx->level_control_attr.remaining_time = ZB_ZCL_LEVEL_CONTROL_REMAINING_TIME_DEFAULT_VALUE;

    ZB_ZCL_SET_ATTRIBUTE(p_dimmable_light_ctx->ep_id, ZB_ZCL_CLUSTER_ID_ON_OFF, ZB_ZCL_CLUSTER_SERVER_ROLE, ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID, (zb_uint8_t *)&p_dimmable_light_ctx->on_off_attr.on_off, ZB_FALSE);
    ZB_ZCL_SET_ATTRIBUTE(p_dimmable_light_ctx->ep_id, ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL, ZB_ZCL_CLUSTER_SERVER_ROLE, ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID, (zb_uint8_t *)&p_dimmable_light_ctx->level_control_attr.current_level, ZB_FALSE);
}

