vke/nrf52840_dimmer_rgbw_zigbee/main.c
// инициализация контекста эндпоинта
void zb_dimmable_light_init_ctx(bulb_device_ctx_t *p_dimmable_light_ctx, uint8_t ep_id, uint8_t pwm_channel)
{
    memset(p_dimmable_light_ctx, 0, sizeof(bulb_device_ctx_t));

    p_dimmable_light_ctx->ep_id = ep_id;
    p_dimmable_light_ctx->pwm_channel = pwm_channel;

    dimmable_clusters_attr_init(p_dimmable_light_ctx);

    // FIXME: аттрибуты level и onoff ставятся внутри dimmable_clusters_attr_init, а тут еще раз перевыставляются
    level_control_set_value(p_dimmable_light_ctx, p_dimmable_light_ctx->level_control_attr.current_level);
}

zb_void_t zb_osif_go_idle(zb_void_t)
{
    zb_osif_wait_for_event();
}

// считывает атрибуты из поступившего сообщения и устанавливает яркость или включает-выключает канал.
zb_ret_t zb_dimmer_light_set_attribute(bulb_device_ctx_t *p_dimmable_light_ctx, zb_zcl_set_attr_value_param_t *p_savp)
{
    zb_ret_t ret = RET_NOT_IMPLEMENTED;

    if (p_savp->cluster_id == ZB_ZCL_CLUSTER_ID_ON_OFF)
    {
        if (p_savp->attr_id == ZB_ZCL_ATTR_ON_OFF_ON_OFF_ID)
        {
            uint8_t value = p_savp->values.data8;
            on_off_set_value(p_dimmable_light_ctx, (zb_bool_t)value);
            ret = RET_OK;
            NRF_LOG_INFO("on/off attribute setting to %hd", value);
        }
    }
    else if (p_savp->cluster_id == ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL)
    {
        if (p_savp->attr_id == ZB_ZCL_ATTR_LEVEL_CONTROL_CURRENT_LEVEL_ID)
        {
            uint16_t value = p_savp->values.data16;
            level_control_set_value(p_dimmable_light_ctx, value);
            ret = RET_OK;
            NRF_LOG_INFO("level control attribute setting to %hd", value);
        }
    }
    else
    {
        NRF_LOG_INFO("Unhandled cluster attribute id: %d", p_savp->cluster_id);
    }

    return ret;
}

// обработчик событий, вызываемый при изменении аттрибутов ZCL у эндпоинтов
static zb_void_t zcl_device_cb(zb_bufid_t bufid)
{
    zb_uint8_t cluster_id;
    zb_uint8_t attr_id;
    zb_zcl_device_callback_param_t *p_device_cb_param = ZB_BUF_GET_PARAM(bufid, zb_zcl_device_callback_param_t);

    NRF_LOG_INFO("Received ZCL callback %hd on endpoint %hu", p_device_cb_param->device_cb_id, p_device_cb_param->endpoint);

    bulb_device_ctx_t *p_dimmable_light_ctx = find_ctx_by_ep_id(p_device_cb_param->endpoint);
    if (!p_dimmable_light_ctx)
    {
        NRF_LOG_WARNING("Context for endpoint %hu not found", p_device_cb_param->endpoint);
        return;
    }

    p_device_cb_param->status = RET_OK;

    switch (p_device_cb_param->device_cb_id)
    {
    case ZB_ZCL_LEVEL_CONTROL_SET_VALUE_CB_ID:
        NRF_LOG_INFO("Level control setting to %d", p_device_cb_param->cb_param.level_control_set_value_param.new_value);
        level_control_set_value(p_dimmable_light_ctx, p_device_cb_param->cb_param.level_control_set_value_param.new_value);
        break;

    case ZB_ZCL_SET_ATTR_VALUE_CB_ID:
        zb_dimmer_light_set_attribute(p_dimmable_light_ctx, &p_device_cb_param->cb_param.set_attr_value_param);
        break;

    default:
        p_device_cb_param->status = RET_ERROR;
        break;
    }

    NRF_LOG_INFO("zcl_device_cb status: %hd", p_device_cb_param->status);
}

// обработчик основных событий в стеке зигби - старт, стоп, наличие проблем и вот это вот всё.
void zboss_signal_handler(zb_bufid_t bufid)
{
    zb_zdo_app_signal_hdr_t *p_sg_p = NULL;
    zb_zdo_app_signal_type_t sig = zb_get_app_signal(bufid, &p_sg_p);
    zb_ret_t status = ZB_GET_APP_SIGNAL_STATUS(bufid);
    zb_bool_t comm_status;

    switch (sig)
    {
    case ZB_BDB_SIGNAL_DEVICE_FIRST_START:
        NRF_LOG_INFO("ZB_BDB_SIGNAL_DEVICE_FIRST_START: %d", status);
        break;
    case ZB_BDB_SIGNAL_DEVICE_REBOOT:
        NRF_LOG_INFO("ZB_BDB_SIGNAL_DEVICE_REBOOT: %d", status);
        break;
    case ZB_COMMON_SIGNAL_CAN_SLEEP:
        NRF_LOG_INFO("ZB_COMMON_SIGNAL_CAN_SLEEP: %d", status);
        break;
    case ZB_ZDO_SIGNAL_PRODUCTION_CONFIG_READY:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_PRODUCTION_CONFIG_READY: %d", status);
        break;
    case ZB_ZDO_SIGNAL_LEAVE:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_LEAVE: %d", status);
        break;
    case ZB_ZDO_SIGNAL_ERROR:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_ERROR: %d", status);
        break;
    case ZB_ZDO_SIGNAL_DEFAULT_START:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_DEFAULT_START: %d", status);
        break;
    case ZB_ZDO_SIGNAL_SKIP_STARTUP:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_SKIP_STARTUP: %d", status);
        break;
    case ZB_ZDO_SIGNAL_DEVICE_ANNCE:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_DEVICE_ANNCE: %d", status);
        break;
    case ZB_BDB_SIGNAL_STEERING:
        NRF_LOG_INFO("ZB_BDB_SIGNAL_STEERING: %d", status);
        break;
    case ZB_BDB_SIGNAL_FORMATION:
        NRF_LOG_INFO("ZB_BDB_SIGNAL_FORMATION: %d", status);
        break;
    case ZB_BDB_SIGNAL_FINDING_AND_BINDING_TARGET_FINISHED:
        NRF_LOG_INFO("ZB_BDB_SIGNAL_FINDING_AND_BINDING_TARGET_FINISHED: %d", status);
        break;
    case ZB_BDB_SIGNAL_FINDING_AND_BINDING_INITIATOR_FINISHED:
        NRF_LOG_INFO("ZB_BDB_SIGNAL_FINDING_AND_BINDING_INITIATOR_FINISHED: %d", status);
        break;
    case ZB_ZGP_SIGNAL_COMMISSIONING:
        NRF_LOG_INFO("ZB_ZGP_SIGNAL_COMMISSIONING: %d", status);
        break;
    case ZB_NWK_SIGNAL_NO_ACTIVE_LINKS_LEFT:
        NRF_LOG_INFO("ZB_NWK_SIGNAL_NO_ACTIVE_LINKS_LEFT: %d", status);
        break;
    case ZB_ZDO_SIGNAL_DEVICE_AUTHORIZED:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_DEVICE_AUTHORIZED: %d", status);
        break;
    case ZB_NWK_SIGNAL_DEVICE_ASSOCIATED:
        NRF_LOG_INFO("ZB_NWK_SIGNAL_DEVICE_ASSOCIATED: %d", status);
        break;
    case ZB_ZDO_SIGNAL_LEAVE_INDICATION:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_LEAVE_INDICATION: %d", status);
        break;
    case ZB_BDB_SIGNAL_WWAH_REJOIN_STARTED:
        NRF_LOG_INFO("ZB_BDB_SIGNAL_WWAH_REJOIN_STARTED: %d", status);
        break;
    case ZB_ZDO_SIGNAL_DEVICE_UPDATE:
        NRF_LOG_INFO("ZB_ZDO_SIGNAL_DEVICE_UPDATE: %d", status);
        break;
    case ZB_NWK_SIGNAL_PANID_CONFLICT_DETECTED:
        NRF_LOG_INFO("ZB_NWK_SIGNAL_PANID_CONFLICT_DETECTED: %d", status);
        break;
    case ZB_NLME_STATUS_INDICATION:
        NRF_LOG_INFO("ZB_NLME_STATUS_INDICATION: %d", status);
        break;
    default:
        NRF_LOG_INFO("Unhandled signal %d. Status: %d", sig, status);
        break;
    }

    zigbee_led_status_update(bufid, ZIGBEE_NETWORK_STATE_LED);

    // передача управления дефолтному обработчику сигналов
    ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
    zb_buf_free(bufid);
}

// зажатая юзерская кнопка при (ре)старте приводит к полной амнезии
zb_bool_t check_erase_persistent_storage()
{
    nrf_gpio_cfg_input(ERASE_PERSISTENT_CONFIG_PIN, NRF_GPIO_PIN_PULLUP);

    volatile uint32_t pin_state;

    for (int i = 0; i < 10; i++)
        pin_state = nrf_gpio_pin_read(ERASE_PERSISTENT_CONFIG_PIN);

    nrf_gpio_cfg_default(ERASE_PERSISTENT_CONFIG_PIN);

    return (pin_state == 0) ? ZB_TRUE : ZB_FALSE;
}

int main(void)
{
    zb_ret_t zb_err_code;
    zb_ieee_addr_t ieee_addr; // здесь будет длинный адрес ноды
    zb_bool_t erase_persistent_storage;

    erase_persistent_storage = ERASE_PERSISTENT_CONFIG;
    if (erase_persistent_storage != ZB_TRUE)
        erase_persistent_storage = check_erase_persistent_storage();

