vke/nrf52840_dimmer_rgbw_zigbee/main.c
    timer_init(); // запускаем таймеры, без них ничего работать не будет :)
    log_init(); // инициализация движка логгирования (в последовательный порт в нашем случае)
    board_init(); // инициализация платы

    ZB_SET_TRACE_LEVEL(ZIGBEE_TRACE_LEVEL); // настройки логгирования (как много писать в логи)
    ZB_SET_TRACE_MASK(ZIGBEE_TRACE_MASK);
    ZB_SET_TRAF_DUMP_OFF();

    ZB_INIT("dimmer_rgbw");

    zb_osif_get_ieee_eui64(ieee_addr); // читаем полный адрес из памяти
    zb_set_long_address(ieee_addr); // и устанавливаем его

    zb_set_network_router_role(IEEE_CHANNEL_MASK); // роутером будем
    zb_set_max_children(MAX_CHILDREN); // максимальное количество дочерних девайсов у роутера
    zigbee_erase_persistent_storage(erase_persistent_storage); // очищать или нет конфиг при старте
    zb_set_keepalive_timeout(ZB_MILLISECONDS_TO_BEACON_INTERVAL(3000));

    ZB_AF_REGISTER_DEVICE_CTX(&dimmable_light_ctx); // регистрируем список эндпоинтов в стеке

    ZB_ZCL_REGISTER_DEVICE_CB(zcl_device_cb); // коллбэк-функция, которая будет вызываться при изменении состояния эндпоинтов

    zb_dimmable_light_init_ctx(&m_dev_ctx_r, HA_DIMMABLE_LIGHT_ENDPOINT_R, 0); // инициализируем каждый из 4 эндпоинтов, указываем номер канала ШИМ
    zb_dimmable_light_init_ctx(&m_dev_ctx_g, HA_DIMMABLE_LIGHT_ENDPOINT_G, 1);
    zb_dimmable_light_init_ctx(&m_dev_ctx_b, HA_DIMMABLE_LIGHT_ENDPOINT_B, 2);
    zb_dimmable_light_init_ctx(&m_dev_ctx_w, HA_DIMMABLE_LIGHT_ENDPOINT_W, 3);

    nrf_802154_tx_power_set(8);

    zb_err_code = zboss_start_no_autostart(); // запуск стека зигби
    ZB_ERROR_CHECK(zb_err_code);

    while (1) // вечный цикл, в котором крутится вся жизнь приложения
    {
        zboss_main_loop_iteration();
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    }
}